# Jupyter Notebook 소개
## Code cell과 Markdown Cell
### Code cell
** 진하게 ** *기울여 쓰기*
#### Markdown Cell

[구글](https://www.google.com/)

In [ ]:
print('Hello World!');

import time;
time.sleep(3);

def say_hello(recipient):
    return 'Hello, {}!'.format(recipient)

say_hello('Tim')

In [ ]:
name = "asd"

name

In [2]:
import numpy as np
def square(x):
    return x * x

In [17]:
x = np.random.randint(1, 10)
y = square(x)
print('%d squared is %d' % (x, y))

1 squared is 1

In [19]:
%matplotlib inline
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns 
sns.set(style="darkgrid")

In [21]:
df = pd.read_csv('fortune500.csv')

In [22]:
df.head()

   Year  Rank           Company  Revenue (in millions) Profit (in millions)
0  1955     1    General Motors                 9823.5                  806
1  1955     2       Exxon Mobil                 5661.4                584.8
2  1955     3        U.S. Steel                 3250.4                195.4
3  1955     4  General Electric                 2959.1                212.6
4  1955     5            Esmark                 2510.8                 19.1

In [23]:
df.tail()

,Year,Rank,Company,Revenue (in millions),Profit (in millions)
25495,2005,496,Wm. Wrigley Jr.,3648.6,493
25496,2005,497,Peabody Energy,3631.6,175.4
25497,2005,498,Wendy's International,3630.4,57.8
25498,2005,499,Kindred Healthcare,3616.6,70.6
25499,2005,500,Cincinnati Financial,3614.0,584

In [24]:
df.columns = ['year', 'rank', 'company', 'revenue', 'profit']

In [25]:
len(df)

25500

In [26]:
df.head()

   year  rank           company  revenue profit
0  1955     1    General Motors   9823.5    806
1  1955     2       Exxon Mobil   5661.4  584.8
2  1955     3        U.S. Steel   3250.4  195.4
3  1955     4  General Electric   2959.1  212.6
4  1955     5            Esmark   2510.8   19.1